tutorials/bladeMachines/compressible/steadyCompressibleFoam/2bump/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="steadyCompressibleFoam"

runApplication $application
